---
kind: type
id: T:Autodesk.Revit.DB.AlphanumericRevisionSettings
source: html/ee27c0eb-9f9b-b59c-728d-24b2654a2bc2.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings

Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.

## Syntax (C#)
```csharp
public class AlphanumericRevisionSettings : IDisposable
```